<template>
  <div class="faq" @click.self="emit('close')">
    <div class="faq__card">
      Часто задаваемые вопросы (FAQ)<br /><br />
      1. Что такое "By Talent"?<br /><br />
      "By Talent" - это онлайн-платформа, которая позволяет пользователям
      создавать и моделировать трехмерные интерьеры. Она объединяет
      разработчиков, дизайнеров и отделочников для совместной работы над
      интерьерными проектами и воплощения идей в жизнь. 2. <br /><br />Как
      начать использовать платформу?<br /><br />
      Чтобы начать, просто зарегистрируйтесь на платформе "By Talent". После
      регистрации вы сможете изучить различные функции и инструменты, доступные
      для создания ваших трехмерных интерьерных проектов. 3. <br /><br />Нужно
      ли мне устанавливать дополнительное программное обеспечение для
      использования платформы?<br /><br />
      Нет, вам не нужно устанавливать дополнительное программное обеспечение для
      использования "By Talent". Она полностью работает в веб-браузере, и вы
      можете получить доступ к ней из любого современного браузера. 4.
      <br /><br />Могу ли я сотрудничать с другими пользователями над моими
      интерьерными проектами?<br /><br />
      Да, "By Talent" позволяет сотрудничать с другими пользователями. Вы можете
      приглашать разработчиков, дизайнеров и отделочников для совместной работы
      над вашими проектами. Платформа обеспечивает удобное совместное
      использование и редактирование в режиме реального времени, что делает
      совместную работу эффективной и удобной. 5. <br /><br />Насколько
      безопасны мои данные на платформе?<br /><br />
      Мы серьезно относимся к безопасности данных. Все ваши личные данные и
      данные проектов защищены с помощью шифрования, соответствующего стандартам
      отрасли. Кроме того, мы строго соблюдаем политику конфиденциальности,
      чтобы обеспечить безопасность и конфиденциальность вашей информации. 6.<br /><br />
      Есть ли какие-либо затраты при использовании "By Talent"?<br /><br />
      "By Talent" предлагает как бесплатные, так и платные планы. Бесплатный
      план предоставляет основные функции, в то время как платный план
      предоставляет дополнительные возможности и расширенные инструменты для
      сотрудничества. Дополнительные детали о стоимости доступны на нашей
      странице с тарифами. 7. <br /><br />Могу ли я экспортировать свои
      трехмерные интерьерные проекты в другое программное обеспечение или
      форматы?<br /><br />
      Да, "By Talent" позволяет экспортировать проекты в различные форматы,
      такие как OBJ, FBX и другие. Вы можете легко передавать свою работу в
      другие программы для трехмерного моделирования, если это необходимо. 8.
      <br /><br />Какая поддержка доступна для пользователей?<br /><br />
      Мы предоставляем всестороннюю поддержку нашим пользователям. Если у вас
      возникли вопросы или проблемы при использовании платформы, наша отдельная
      команда поддержки доступна для помощи через электронную почту или наш
      форум поддержки. 9. <br /><br />Подходит ли "By Talent" для
      профессионального использования? <br /><br />Абсолютно! "By Talent"
      разработана для удовлетворения как любителей, так и профессионалов в
      области дизайна интерьера. Благодаря передовым инструментам и функциям
      сотрудничества, она может стать отличным ресурсом для профессионалов,
      работающих над сложными интерьерными проектами. 10. <br /><br />Как я могу
      быть в курсе новых функций и улучшений?<br /><br />
      Мы постоянно работаем над улучшением платформы и добавлением новых
      функций. Чтобы быть в курсе последних новостей, следите за нашим блогом и
      социальными медиа, где мы делаем объявления, публикуем обучающие материалы
      и обновления о последних улучшениях.<br /><br /><br />
      <div class="faq__card_btns">
        <img
          src="@/assets/components/ask.svg"
          alt="accept"
          width="116"
          height="24"
        />
        <img
          @click="emit('close')"
          src="@/assets/components/close.svg"
          alt="accept"
          width="116"
          height="24"
        />
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
const emit = defineEmits(["close"]);
</script>

<style lang="scss" scoped>
.faq {
  position: fixed;
  bottom: 0;
  top: 0;
  left: 0;
  right: 0;
  display: flex;
  align-items: center;
  justify-content: center;
  &__card {
    width: 70%;
    height: 80%;
    background-color: #f9f9f9;

    padding: 48px;

    color: #191919;
    /* Jura/28 Header 5 */
    font-family: JuraMedium;
    font-size: 14px;
    font-style: normal;
    font-weight: 500;
    line-height: 100%; /* 28px */
    letter-spacing: -0.56px;
    overflow-y: scroll;
    &_btns {
      display: flex;
      column-gap: 12px;
      margin-left: 50%;
      transform: translateX(-25%);
      cursor: pointer;
    }
  }
}
</style>
