<template>
  <div class="personal-data" @click.self="emit('close')">
    <div class="personal-data__card">
      Соглашение на обработку персональных данных<br /><br />
      Пользователь, присоединяясь к использованию интернет-портала "By Talent",
      дает свое согласие на обработку своих персональных данных в соответствии с
      нижеследующими условиями:<br /><br />
      Обработка персональных данных осуществляется в соответствии с действующим
      законодательством о защите персональных данных и Политикой
      конфиденциальности портала "By Talent".<br /><br />
      Пользователь дает согласие на сбор, хранение, обработку и использование
      своих персональных данных порталом "By Talent" в целях предоставления
      доступа к функциональности портала, а также для обеспечения качества и
      оптимизации предоставляемых услуг.<br /><br />
      Пользователь также соглашается на получение информационных сообщений,
      уведомлений и рекламных материалов от портала "By Talent" на указанные им
      контактные данные (электронную почту и/или телефон), связанных с
      функционированием портала и предоставляемыми услугами.<br /><br />
      Пользователь имеет право в любой момент отозвать свое согласие на
      обработку персональных данных, направив соответствующее уведомление на
      электронную почту, указанную в Контактах портала "By Talent". В случае
      отзыва согласия, доступ к функциональности портала может быть ограничен
      или прекращен.<br /><br />
      Портал "By Talent" обязуется обеспечить надлежащую защиту персональных
      данных пользователя, включая предотвращение несанкционированного доступа,
      утраты, изменения или раскрытия такой информации.<br /><br />
      Пользователь подтверждает, что предоставляет свои персональные данные
      добровольно и осознает права и обязанности, связанные с предоставлением
      такой информации.<br /><br />
      Данное Соглашение является неотъемлемой частью Пользовательского
      соглашения и Политики конфиденциальности портала "By Talent", а также
      применяется в полной мере в отношении всех пользователей портала.<br /><br />
      При использовании портала "By Talent" и предоставлении своих персональных
      данных, пользователь подтверждает свое согласие с данным Соглашением на
      обработку персональных данных.<br /><br /><br />

      <img
        @click="handlerAccept"
        class="personal-data__card_accept"
        src="@/assets/components/accept-white.svg"
        alt="accept"
        width="116"
        height="24"
      />
    </div>
  </div>
</template>

<script setup lang="ts">
import { useDocStore } from "@/store";

const docStore = useDocStore();
const emit = defineEmits(["close"]);

function handlerAccept() {
  docStore.personalData = true;
  emit("close");
}
</script>

<style lang="scss" scoped>
.personal-data {
  position: fixed;
  bottom: 0;
  top: 0;
  left: 0;
  right: 0;
  display: flex;
  align-items: center;
  justify-content: center;
  z-index: 3;
  &__card {
    position: relative;
    width: 70%;
    height: 80%;
    background-color: black;

    padding: 48px;

    color: white;
    /* Jura/28 Header 5 */
    font-family: JuraMedium;
    font-size: 14px;
    font-style: normal;
    font-weight: 500;
    line-height: 100%; /* 28px */
    letter-spacing: -0.56px;
    overflow-y: scroll;
    &_accept {
      left: 50%;
      transform: translateX(-50%);
      cursor: pointer;
      position: absolute;
      bottom: 48px;
    }
  }
}
</style>
