<template>
  <div class="terms-user" @click.self="emit('close')">
    <div class="terms-user__card">
      Пользовательское соглашение<br /><br />
      Пожалуйста, внимательно прочитайте данное Пользовательское соглашение
      перед использованием интернет-портала "By Talent". Данное соглашение
      устанавливает условия использования портала и регулирует ваш доступ к
      функциональности и услугам, предоставляемым нашим порталом.<br /><br /><br />
      Определения:<br /><br />
      1.1. "Портал" или "By Talent" - интернет-портал, предоставляющий
      возможность создания трехмерных интерьеров и связанные с ними услуги.<br />
      1.2. "Пользователь" - физическое или юридическое лицо, получающее доступ к
      порталу и использующее его функциональность.<br />
      1.3."Соглашение" - данное Пользовательское соглашение и все документы, на
      которые оно ссылается. 1.4. "Содержимое пользователя" - все
      тексты,изображения, модели и другие материалы, которые пользователь
      загружает, размещает или создает на портале. <br /><br /><br />
      Права и обязанности пользователя:<br /><br />
      2.1. Пользователь обязуется предоставлять достоверную информацию при
      регистрации на портале и поддерживать актуальность своих данных. 2.2.
      Пользователь обязуется соблюдать законы и правила использования
      интернет-портала "By Talent".<br />
      2.3. Пользователь несет ответственность за содержимое, которое он
      загружает или размещает на портале, и гарантирует, что у него есть
      необходимые права на использование такого содержимого. 2.4. Пользователь
      обязуется не нарушать права других пользователей и третьих лиц при
      использовании портала.<br />
      2.5. Пользователь несет ответственность за сохранение своего пароля и не
      передает его третьим лицам.<br /><br /><br />
      Права и обязанности портала "By Talent": <br /><br />
      3.1. Портал предоставляет пользователю доступ к функциональности,
      определенной в рамках текущих условий соглашения. <br />
      3.2. Портал имеет право временно ограничить или приостановить доступ
      пользователя к порталу в случае нарушения условий данного соглашения или в
      целях обслуживания и модернизации системы. <br />
      3.3. Портал имеет право использовать анонимизированные данные
      пользователей в статистических целях и для улучшения качества
      предоставляемых услуг.<br /><br /><br />
      Конфиденциальность и защита данных: <br /><br />
      4.1. Портал соблюдает политику конфиденциальности, которая регулирует
      сбор, хранение и обработку персональных данных пользователей. <br />
      4.2. Пользователь подтверждает свое согласие с политикой
      конфиденциальности при использовании портала.<br /><br /><br />
      Интеллектуальная собственность: <br /><br />
      5.1. Все авторские права и права интеллектуальной собственности на контент
      и функциональность портала "By Talent" принадлежат порталу или
      соответствующим правообладателям. <br />
      5.2. Пользователь соглашается не воспроизводить, распространять, изменять
      или использовать контент портала без предварительного разрешения
      правообладателя. <br /><br /><br />Ограничение ответственности:
      <br /><br />
      6.1. Портал "By Talent" не несет ответственности за содержимое, созданное
      или размещенное пользователями на портале.<br />
      6.2. Портал "By Talent" не несет ответственности за любые убытки или
      ущерб, возникшие в результате использования портала или его
      функциональности. <br /><br /><br />Изменения в соглашении:<br />
      7.1. Портал имеет право вносить изменения и дополнения в данное
      пользовательское соглашение. Изменения вступают в силу после их
      опубликования на портале.<br /><br /><br />
      Заключительные положения: <br /><br />
      8.1. Данное соглашение является юридически обязывающим документом для всех
      пользователей портала "By Talent". <br />
      8.2. В случае возникновения споров или разногласий, связанных с
      использованием портала, стороны будут стремиться разрешить их путем
      переговоров.<br /><br /><br />
      С использованием интернет-портала "By Talent" вы подтверждаете свое
      согласие с данным Пользовательским соглашением и обязуетесь следовать его
      условиям. Если вы не согласны с условиями соглашения, пожалуйста, не
      используйте данный портал.<br /><br /><br />
      <img
        @click="handlerAccept"
        class="terms-user__card_accept"
        src="@/assets/components/accept-black.svg"
        alt="accept"
        width="116"
        height="24"
      />
    </div>
  </div>
</template>

<script setup lang="ts">
import { useDocStore } from "@/store";

const docStore = useDocStore();
const emit = defineEmits(["close"]);

function handlerAccept() {
  docStore.termsUser = true;
  emit("close");
}
</script>

<style lang="scss" scoped>
.terms-user {
  position: fixed;
  bottom: 0;
  top: 0;
  left: 0;
  right: 0;
  display: flex;
  align-items: center;
  justify-content: center;
  &__card {
    width: 70%;
    height: 80%;
    background-color: #f9f9f9;

    padding: 48px;

    color: #191919;
    /* Jura/28 Header 5 */
    font-family: JuraMedium;
    font-size: 14px;
    font-style: normal;
    font-weight: 500;
    line-height: 100%; /* 28px */
    letter-spacing: -0.56px;
    overflow-y: scroll;
    &_accept {
      margin-left: 50%;
      transform: translateX(-50%);
      cursor: pointer;
    }
  }
}
</style>
